results/cpu-vs-latency4/memcached/15-2/nsl202.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
read error: Connection reset by peer
read error: Connection reset by peer
read error: Connection reset by peer
[RUN #1 103%,  30 secs]  0 threads:     5252965 ops,       0 (avg:  170499) ops/sec, 0.00KB/sec (avg: 6.43MB/sec),  0.00 (avg:  1.35) msec latency

15        Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets       15921.07          ---          ---      1.36800      1180.16
Gets      159177.06     39692.27    119484.79      1.34800      5581.71
Totals    175098.13     39692.27    119484.79      1.35000      6761.87


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     81.54172
SET       2.000     95.24259
SET       3.000     95.66174
SET       4.000     96.15312
SET       5.000     96.92254
SET       6.000     98.23631
SET       7.000     98.23652
SET       8.000     98.23735
SET       9.000     98.30519
SET      10.000     99.06435
SET      11.000     99.91939
SET      12.000     99.99895
SET      13.000    100.00000
---
GET       0.065      0.00002
GET       0.066      0.00004
GET       0.070      0.00006
GET       0.072      0.00008
GET       0.073      0.00010
GET       0.075      0.00017
GET       0.076      0.00021
GET       0.077      0.00031
GET       0.078      0.00040
GET       0.080      0.00048
GET       0.081      0.00054
GET       0.082      0.00063
GET       0.083      0.00073
GET       0.084      0.00090
GET       0.085      0.00098
GET       0.086      0.00117
GET       0.087      0.00140
GET       0.088      0.00182
GET       0.089      0.00209
GET       0.090      0.00249
GET       0.091      0.00318
GET       0.092      0.00377
GET       0.093      0.00477
GET       0.094      0.00542
GET       0.095      0.00660
GET       0.096      0.00766
GET       0.097      0.00854
GET       0.098      0.01003
GET       0.099      0.01133
GET       0.100      0.01855
GET       0.110      0.04140
GET       0.120      0.09344
GET       0.130      0.21787
GET       0.140      0.53833
GET       0.150      1.07431
GET       0.160      1.67417
GET       0.170      2.33402
GET       0.180      3.12246
GET       0.190      4.20528
GET       0.200      5.20372
GET       0.210      5.84112
GET       0.220      6.26028
GET       0.230      6.59033
GET       0.240      6.93118
GET       0.250      7.29600
GET       0.260      7.69834
GET       0.270      8.20775
GET       0.280      8.89928
GET       0.290      9.87102
GET       0.300     11.00537
GET       0.310     12.21568
GET       0.320     13.49230
GET       0.330     14.86879
GET       0.340     16.40695
GET       0.350     17.82434
GET       0.360     19.02505
GET       0.370     20.03235
GET       0.380     20.88638
GET       0.390     21.61459
GET       0.400     22.16020
GET       0.410     22.55555
GET       0.420     22.85994
GET       0.430     23.12051
GET       0.440     23.37396
GET       0.450     23.63620
GET       0.460     23.93005
GET       0.470     24.26986
GET       0.480     24.66441
GET       0.490     25.12948
GET       0.500     25.62830
GET       0.510     26.15992
GET       0.520     26.71241
GET       0.530     27.28404
GET       0.540     27.86228
GET       0.550     28.40446
GET       0.560     28.90514
GET       0.570     29.37174
GET       0.580     29.80196
GET       0.590     30.20101
GET       0.600     30.55734
GET       0.610     30.87137
GET       0.620     31.15501
GET       0.630     31.41301
GET       0.640     31.64227
GET       0.650     31.83168
GET       0.660     31.98987
GET       0.670     32.12186
GET       0.680     32.22662
GET       0.690     32.30729
GET       0.700     32.36819
GET       0.710     32.41589
GET       0.720     32.45214
GET       0.730     32.48252
GET       0.740     32.50809
GET       0.750     32.53125
GET       0.760     32.55312
GET       0.770     32.57498
GET       0.780     32.59709
GET       0.790     32.62153
GET       0.800     32.64896
GET       0.810     32.67945
GET       0.820     32.71264
GET       0.830     32.75329
GET       0.840     32.79984
GET       0.850     32.85188
GET       0.860     32.91194
GET       0.870     32.98264
GET       0.880     33.06445
GET       0.890     33.15936
GET       0.900     33.26615
GET       0.910     33.38499
GET       0.920     33.52444
GET       0.930     33.67898
GET       0.940     33.84775
GET       0.950     34.03395
GET       0.960     34.23386
GET       0.970     34.45363
GET       0.980     34.69311
GET       0.990     34.94378
GET       1.000     36.87617
GET       1.100     55.38184
GET       1.200     71.14014
GET       1.300     72.85782
GET       1.400     73.29580
GET       1.500     73.60191
GET       1.600     76.24309
GET       1.700     81.01447
GET       1.800     86.48542
GET       1.900     88.30284
GET       2.000     88.61939
GET       2.100     88.80199
GET       2.200     89.60344
GET       2.300     91.11312
GET       2.400     91.64462
GET       2.500     92.18597
GET       2.600     93.91213
GET       2.700     95.23698
GET       2.800     95.68177
GET       2.900     95.77166
GET       3.000     95.78884
GET       3.100     95.79692
GET       3.200     95.82990
GET       3.300     95.92089
GET       3.400     95.97649
GET       3.500     96.03965
GET       3.600     96.11648
GET       3.700     96.15001
GET       3.800     96.15886
GET       3.900     96.16234
GET       4.000     96.16355
GET       4.100     96.16412
GET       4.200     96.16448
GET       4.300     96.16492
GET       4.400     96.16517
GET       4.500     96.16542
GET       4.600     96.16554
GET       4.700     96.16579
GET       4.800     96.16598
GET       4.900     96.16674
GET       5.000     96.16780
GET       5.100     96.17160
GET       5.200     96.18070
GET       5.300     96.19917
GET       5.400     96.25136
GET       5.500     96.38942
GET       5.600     96.68369
GET       5.700     97.08552
GET       5.800     97.47040
GET       5.900     97.76330
GET       6.000     97.95047
GET       6.100     98.07146
GET       6.200     98.14974
GET       6.300     98.19552
GET       6.400     98.21885
GET       6.500     98.22802
GET       6.600     98.23250
GET       6.700     98.23516
GET       6.800     98.23625
GET       6.900     98.23719
GET       7.000     98.23838
GET       7.100     98.23958
GET       7.200     98.24006
GET       7.300     98.24029
GET       7.400     98.24052
GET       7.500     98.24071
GET       7.600     98.24100
GET       7.700     98.24136
GET       7.800     98.24165
GET       7.900     98.24178
GET       8.000     98.24209
GET       8.100     98.24240
GET       8.200     98.24280
GET       8.300     98.24322
GET       8.400     98.24356
GET       8.500     98.24406
GET       8.600     98.24444
GET       8.700     98.24456
GET       8.800     98.24488
GET       8.900     98.24511
GET       9.000     98.24586
GET       9.100     98.24730
GET       9.200     98.24925
GET       9.300     98.25216
GET       9.400     98.25725
GET       9.500     98.26586
GET       9.600     98.27863
GET       9.700     98.29890
GET       9.800     98.32902
GET       9.900     98.37017
GET      10.000     98.90988
GET      11.000     99.89921
GET      12.000     99.99487
GET      13.000     99.99996
GET      14.000    100.00000