results/cpu-vs-latency4/memcached/15-2/nsl207.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
connect: connection failed: Connection timed out
connect: connection failed: Connection timed out
connect: connection failed: Connection timed out
[...]
read error: Connection reset by peer
read error: Connection reset by peer
read error: Connection reset by peer
[...]
[RUN #1 146%,  43 secs]  0 threads:     4447141 ops,       0 (avg:  101238) ops/sec, 0.00KB/sec (avg: 3.82MB/sec),  0.00 (avg:  1.73) msec latency

15        Threads
16        Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets            inf          ---          ---      9.14600          inf
Gets            inf          inf          inf      0.98800          inf
Totals          inf          inf          inf      1.72900          inf


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     58.60875
SET       2.000     72.75515
SET       3.000     76.74166
SET       4.000     82.65095
SET       5.000     87.98805
SET       6.000     92.37193
SET       7.000     94.38966
SET       8.000     94.53728
SET       9.000     95.44823
SET      10.000     97.51517
SET      11.000     97.79459
SET      12.000     99.98442
SET      13.000     99.98492
SET      14.000     99.98516
SET      15.000     99.98541
SET      16.000     99.98566
SET      17.000     99.98591
SET      18.000     99.98665
SET      20.000     99.98739
SET      21.000     99.98764
SET    66000.000    100.00000
---
GET       0.059      0.00002
GET       0.064      0.00005
GET       0.065      0.00012
GET       0.067      0.00015
GET       0.068      0.00020
GET       0.070      0.00032
GET       0.071      0.00045
GET       0.072      0.00047
GET       0.073      0.00052
GET       0.074      0.00059
GET       0.075      0.00069
GET       0.076      0.00079
GET       0.077      0.00089
GET       0.078      0.00099
GET       0.079      0.00114
GET       0.080      0.00124
GET       0.081      0.00136
GET       0.082      0.00178
GET       0.083      0.00233
GET       0.084      0.00289
GET       0.085      0.00341
GET       0.086      0.00413
GET       0.087      0.00500
GET       0.088      0.00611
GET       0.089      0.00742
GET       0.090      0.00928
GET       0.091      0.01168
GET       0.092      0.01422
GET       0.093      0.01724
GET       0.094      0.02026
GET       0.095      0.02338
GET       0.096      0.02689
GET       0.097      0.03040
GET       0.098      0.03406
GET       0.099      0.03794
GET       0.100      0.05692
GET       0.110      0.10540
GET       0.120      0.19613
GET       0.130      0.45724
GET       0.140      1.27169
GET       0.150      2.42955
GET       0.160      3.38670
GET       0.170      4.31921
GET       0.180      5.59786
GET       0.190      7.91008
GET       0.200      9.77162
GET       0.210     10.72464
GET       0.220     11.32016
GET       0.230     11.84881
GET       0.240     12.54153
GET       0.250     13.25321
GET       0.260     13.94989
GET       0.270     14.83909
GET       0.280     16.20327
GET       0.290     18.49427
GET       0.300     20.83599
GET       0.310     22.88530
GET       0.320     24.87813
GET       0.330     27.19469
GET       0.340     30.16751
GET       0.350     32.45161
GET       0.360     34.08046
GET       0.370     35.37867
GET       0.380     36.56613
GET       0.390     37.68481
GET       0.400     38.45634
GET       0.410     38.98302
GET       0.420     39.40489
GET       0.430     39.81085
GET       0.440     40.25402
GET       0.450     40.69644
GET       0.460     41.15566
GET       0.470     41.70413
GET       0.480     42.42451
GET       0.490     43.33028
GET       0.500     44.21706
GET       0.510     45.09149
GET       0.520     45.97219
GET       0.530     46.94227
GET       0.540     47.94625
GET       0.550     48.77534
GET       0.560     49.44962
GET       0.570     50.01327
GET       0.580     50.52350
GET       0.590     50.95645
GET       0.600     51.27297
GET       0.610     51.51221
GET       0.620     51.69904
GET       0.630     51.85693
GET       0.640     51.99090
GET       0.650     52.09328
GET       0.660     52.17298
GET       0.670     52.23845
GET       0.680     52.29354
GET       0.690     52.33561
GET       0.700     52.36950
GET       0.710     52.39508
GET       0.720     52.41680
GET       0.730     52.43666
GET       0.740     52.45511
GET       0.750     52.47287
GET       0.760     52.49194
GET       0.770     52.51302
GET       0.780     52.53724
GET       0.790     52.56583
GET       0.800     52.59779
GET       0.810     52.63450
GET       0.820     52.67660
GET       0.830     52.72575
GET       0.840     52.78108
GET       0.850     52.84230
GET       0.860     52.91359
GET       0.870     52.99166
GET       0.880     53.08657
GET       0.890     53.19464
GET       0.900     53.31283
GET       0.910     53.43804
GET       0.920     53.58220
GET       0.930     53.75226
GET       0.940     53.93483
GET       0.950     54.13138
GET       0.960     54.34176
GET       0.970     54.56928
GET       0.980     54.82154
GET       0.990     55.08482
GET       1.000     56.86751
GET       1.100     70.68024
GET       1.200     82.83651
GET       1.300     83.85775
GET       1.400     84.04673
GET       1.500     84.21954
GET       1.600     86.00217
GET       1.700     89.38066
GET       1.800     93.30583
GET       1.900     94.65089
GET       2.000     94.80618
GET       2.100     94.83223
GET       2.200     94.84957
GET       2.300     94.89058
GET       2.400     94.92125
GET       2.500     95.18820
GET       2.600     96.32505
GET       2.700     97.33578
GET       2.800     97.60820
GET       2.900     97.65463
GET       3.000     97.66098
GET       3.100     97.66170
GET       3.200     97.66217
GET       3.300     97.66418
GET       3.400     97.66549
GET       3.500     97.66586
GET       3.600     97.66593
GET       4.700     97.66611
GET       4.800     97.66640
GET       4.900     97.66648
GET       5.000     97.66660
GET       5.100     97.66662
GET       5.200     97.66697
GET       5.300     97.67202
GET       5.400     97.69861
GET       5.500     97.77341
GET       5.600     97.93560
GET       5.700     98.17225
GET       5.800     98.40687
GET       5.900     98.58563
GET       6.000     98.70639
GET       6.100     98.78097
GET       6.200     98.83099
GET       6.300     98.86980
GET       6.400     98.89587
GET       6.500     98.90992
GET       6.600     98.91563
GET       6.700     98.91850
GET       6.800     98.92016
GET       6.900     98.92147
GET       7.000     98.92192
GET       7.100     98.92197
GET       7.200     98.92206
GET       7.300     98.92226
GET       7.400     98.92244
GET       7.500     98.92273
GET       7.600     98.92300
GET       7.700     98.92333
GET       7.800     98.92375
GET       7.900     98.92424
GET       8.000     98.92439
GET       8.600     98.92444
GET       8.700     98.92461
GET       8.800     98.92498
GET       8.900     98.92528
GET       9.000     98.92558
GET       9.100     98.92585
GET       9.200     98.92654
GET       9.300     98.92825
GET       9.400     98.93203
GET       9.500     98.93730
GET       9.600     98.94502
GET       9.700     98.95664
GET       9.800     98.97295
GET       9.900     98.99597
GET      10.000     99.30896
GET      11.000     99.91701
GET      12.000     99.99550
GET      13.000     99.99998
GET      14.000    100.00000